#-*- coding: utf-8 -*-

err_list = {
	300:"گزینه های متعدد",
	301:"صفحه موردنظر به صورت دائمی به مکان جدیدی منتقل شده است",
	302:"سرور در حال حاضر، صفحه درخواست شده را از مکان دیگری باز می گرداند",
	303:"سرور درخواست دهنده را به صورت اتوماتیک به مکان دیگری هدایت می کند",
	305:"درخواست کننده تنها درصورتی می تواند به محتوای صفحه دسترسی پیدا کند که از پراکسی استفاده کند",
	307:"سرور به درخواست موردنظر از مکان دیگری پاسخ می دهد",
	400:"سرور syntax درخواست را تشخیص نداده است",
	401:"اجرای درخواست مستلزم کسب تائید است",
	403:"سرور درخواست را رد کرده است",
	404:"سرور صفحه درخواست شده را پیدا نکرده است",
	405:"متد مشخص شده درون درخواست مجاز نیست",
	406:"صفحه درخواست شده با پارامترهایی که برای محتوا مشخص شده اند، همخوانی ندارد.",
	407:"نیاز به تائید با استفاده از پراکسی",
	408:"سرور بیش از حد معمول منتظر درخواست مانده است",
	409:"سرور به هنگام اجرای درخواست دچار تداخل شده است",
	410:"صفحه موجود نیست",
	416:"محدوده درخواست مجاز نیست",
	417:"سرور نمی تواند انتظارات درخواست دهنده را برآورده کند",
	500:"وجود خطای داخلی درون سرور",
	501:"چنین قابلیتی درون سرور پیاده سازی نشده",
	502:"Bad Gateway",
	503:"عملیات سرور مختل شده است",
	504:"Gateway time-out",
	505:"نسخه HTTP پشتیبانی نشده است"
}


